app/controllers/api/airlines_controller.rb

SELECT "airlines".* FROM "airlines"
---
  def index
    @airlines = Airline.all