app/controllers/api/airplane_users_controller.rb

SELECT "airplane_users".* FROM "airplane_users"
---
  def index
    @airplane_users = AirplaneUser.all

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "airplane_users".* FROM "airplane_users" WHERE "airplane_users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def show
    @airplane_user = AirplaneUser.find_by(id: params[:id])

INSERT INTO "airplane_users" ("airplane_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["airplane_id", 8], ["user_id", 7], ["created_at", "2019-12-26 14:56:15.942406"], ["updated_at", "2019-12-26 14:56:15.942406"]]
---
  def create
    @airplane_user = AirplaneUser.new(
        airplane_id: params["airplane_id"],
        user_id: current_user.id
    )
    if @airplane_user.save

SELECT "airplane_users".* FROM "airplane_users" WHERE "airplane_users"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "airplane_users" SET "airplane_id" = $1, "user_id" = $2, "updated_at" = $3 WHERE "airplane_users"."id" = $4  [["airplane_id", 5], ["user_id", 7], ["updated_at", "2019-12-26 15:22:29.827761"], ["id", 15]]
---
  def update
    @airplane_user = AirplaneUser.find_by(id: params["id"])
    @airplane_user.airplane_id = params["airplane_id"] || @airplane_user.airplane_id
    #@airplane_user.user_id = params["user_id"] || @airplane_user.user_id
    @airplane_user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "airplane_users".* FROM "airplane_users" WHERE "airplane_users"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
DELETE FROM "airplane_users" WHERE "airplane_users"."id" = $1  [["id", 15]]
---
  def destroy
    airplane_user = AirplaneUser.find_by(id: params[:id])
    airplane_user.destroy