app/controllers/api/comments_controller.rb

INSERT INTO "comments" ("text", "post_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "coooool !!!"], ["post_id", 1], ["user_id", 3], ["created_at", "2019-12-25 13:43:21.971448"], ["updated_at", "2019-12-25 13:43:21.971448"]]
---
  def create
    @comment = Comment.new(
        text: params["text"],
        post_id: params["post_id"],
        user_id: current_user.id
    )
    if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 4]]
---
  def destroy
    comment = Comment.find_by(id: params[:id])
    comment.destroy