app/controllers/api/images_controller.rb

INSERT INTO "images" ("url", "airplane_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    if params[:image_file]
      response = Cloudinary::Uploader.upload(params[:image_file])
      cloudinary_url = response["secure_url"]
    else
      cloudinary_url = nil
    end

    @image = Image.new(
        url: cloudinary_url,
        airplane_id: params["airplane_id"],
        user_id: current_user.id
    )
    if @image.save

SELECT "images".* FROM "images" WHERE "images"."user_id" = $1 AND "images"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 24], ["LIMIT", 1]]
DELETE FROM "images" WHERE "images"."id" = $1  [["id", 24]]
---
  def destroy
    #image = Image.find_by(id: params[:id])
    image = current_user.images.find_by(id: params[:id])
    image.destroy