app/controllers/api/posts_controller.rb

INSERT INTO "posts" ("text", "user_id", "airplane_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "really really bad on the boing 737 max"], ["user_id", 7], ["airplane_id", 8], ["created_at", "2019-12-25 00:17:07.181894"], ["updated_at", "2019-12-25 00:17:07.181894"]]
---
  def create
    post = Post.new(
        text: params["text"],
        user_id: current_user.id,
        airplane_id: params["airplane_id"]
    )
    if post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 4]]
---
  def destroy
    post = Post.find_by(id: params[:id])
    post.destroy