app/controllers/api/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "phone", "profile_picture", "location", "seat_preference", "class_preference", "airport_preference", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    user = User.new(
        name: params["name"],
        email: params["email"],
        password: params["password"],
        password_confirmation: params[:password_confirmation],
        phone: params["phone"],
        profile_picture: params["profile_picture:"],
        location: params["location"],
        seat_preference: params["seat_preference:"],
        class_preference: params["class_preference:"],
        airport_preference: params["airport_preference:"]
    )
    if user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "profile_picture" = $1, "seat_preference" = $2, "class_preference" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["profile_picture", "https://i.pinimg.com/originals/94/ec/ca/"], ["seat_preference", "window"], ["class_preference", "Business"], ["updated_at", "2020-01-01 18:27:31.296388"], ["id", 19]]
---
  def update
    @user = User.find_by(id: params["id"])
    @user.name = params["name"] || @user.name
    @user.email = params["email"] || @user.email
    @user.phone = params["phone"] || @user.phone
    @user.profile_picture = params["profile_picture"] || @user.profile_picture
    @user.location = params["location"] || @user.location
    @user.seat_preference = params["seat_preference"] || @user.seat_preference
    @user.class_preference = params["class_preference"] || @user.class_preference
    @user.airport_preference = params["airport_preference"] || @user.airport_preference
    @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 8]]
---
  def destroy
    user = User.find_by(id: params["id"])
    user.destroy