app/models/post.rb

SELECT "airplane_users".* FROM "airplane_users" WHERE "airplane_users"."user_id" = $1 AND "airplane_users"."airplane_id" = $2 LIMIT $3  [["user_id", 1], ["airplane_id", 1], ["LIMIT", 1]]
---
  def favorite
    AirplaneUser.find_by(user_id: user.id, airplane_id: airplane.id)